stories/google-io-2016-web-application-installation-steps/index.html
<!DOCTYPE html>
<html prefix="
og: http://ogp.me/ns#
article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Step-by-step installation instructions for the I/O 2016 progressive web application.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Google I/O 2016 Web Application Installation Steps | ncouture
.github.io</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="alternate" type="application/atom+xml" title="Atom" href="../../index.atom">
<link rel="canonical" href="https://ncouture.github.io/stories/google-io-2016-web-application-installation-steps/">
<!--[if lt IE 9]>
        <![endif]--><meta name="description" itemprop="description" content="Step-by-step installation instructions for the I/O 2016 progressive web application.">
<meta name="author" content="Nicolas Couture">
<meta property="og:site_name" content="ncouture
.github.io">
<meta property="og:title" content="Google I/O 2016 Web Application Installation Steps">
<meta property="og:url" content="https://ncouture.github.io/stories/google-io-2016-web-application-installation-steps/">
<meta property="og:description" content="Step-by-step installation instructions for the I/O 2016 progressive web application.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2016-09-17T15:09:12+00:00">
<meta property="article:tag" content="io2016">
<meta property="article:tag" content="progressive web application">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar  header-panel shadow-z-3" role="navigation"><div class="container-fluid">
        <div class="row">
          <div class="col-xs-3">
            <h1 class="title-blog">
                <a href="https://ncouture.github.io/">
                        <span id="blog-title">ncouture
.github.io</span>
                    </a>
            </h1>
          </div>
        </div>
      </div>
<!-- /.container-fluid -->
</nav><div class="container-fluid main" id="content" role="main">
        <div class="row">
            <nav class="col-xs-3 menu"><ul>
<li class="withripple"><a href="../../archive.html">Archive</a></li>
                <li class="withripple"><a href="../../categories/">Tags</a></li>
                <li class="withripple"><a href="../../rss.xml">RSS feed</a></li>

                    
                </ul>
<ul class="nav navbar-nav"></ul></nav><div class="posts-material col-xs-9">
                <div class="col-xs-12 col-md-11 content-material">
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Google I/O 2016 Web Application Installation Steps</a></h1>
<hr></header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
My personal notes on installing the I/O 2016 Web Application (in March 2016).
</p>

<p>
goapp deploy -application &lt;app-id&gt; -version &lt;v&gt; dist/backend/.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Configure Firebase</h2>
<div class="outline-text-2" id="text-1">
<p>
You must use the legacy Firebase dashboard. Do not use the gcloud console. –2016-05-30
</p>

<ol class="org-ol">
<li>Create firebase.com legacy application (&lt;app&gt;.firebaseio.com)
</li>
<li>Get application secret from <a href="https://">https://</a>&lt;app ID&gt;.firebaseio.com/?page=Admin
</li>
<li>Insert secret in backend/server.config.&lt;env&gt;
</li>
</ol>
<div class="highlight"><pre><span></span>"firebase": {
  "secret": "&lt;secret key&gt;",
  "shards": [
    "https://&lt;app ID&gt;.firebaseio.com/"
  ]
},
</pre></div>
<ol class="org-ol">
<li>Enable Google Plus API
<ul class="org-ul">
<li>
<a href="https://console.cloud.google.com/apis/">https://console.cloud.google.com/apis/</a>
</li>
</ul>
</li>
<li>Configure credentials
</li>
</ol>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">CANCELLED Google Cloud Firebase Console does <b>not</b> work   <span class="tag"><span class="CANCELLED">CANCELLED</span></span>
</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://github.com/GoogleChrome/ioweb2016/pull/514#issuecomment-205866122">https://github.com/GoogleChrome/ioweb2016/pull/514#issuecomment-205866122</a>
</p>

<ul class="org-ul">
<li>
<a href="https://console.firebase.google.com/project/">https://console.firebase.google.com/project/</a>&lt;project name&gt;/settings/database
</li>
<li>Database
</li>
<li>Database secrets
<ul class="org-ul">
<li>Show existing legacy token
</li>
<li>Create custom database authentication tokens using a legacy Firebase token generator. At least one secret must exist at all times.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Deploy</h2>
<div class="outline-text-2" id="text-2">
<p>
These are my personal notes. Tested on Debian stretch.
</p>

<p>
See <a href="https://github.com/GoogleChrome/ioweb2016">https://github.com/GoogleChrome/ioweb2016</a> for more detailed instructions.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Download Google App Engine SDK for Go</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>
<a href="https://cloud.google.com/appengine/downloads#Google_App_Engine_SDK_for_Go">https://cloud.google.com/appengine/downloads#Google_App_Engine_SDK_for_Go</a>
</li>
</ul>
<div class="highlight"><pre><span></span>unzip go_appengine_sdk_linux_&lt;arch&gt;_&lt;version&gt;.zip
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Configure</h3>
<div class="outline-text-3" id="text-2-2">
<div class="highlight"><pre><span></span>mv go_appengine ~/.go_appengine
export PATH=~/.go_appengine:"$PATH"
export GOPATH=~/.go_appengine/gopath
export GOROOT=~/.go_appengine/goroot
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Install node dependencies</h3>
<div class="outline-text-3" id="text-2-3">
<div class="highlight"><pre><span></span>npm install
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Build</h3>
<div class="outline-text-3" id="text-2-4">
<div class="highlight"><pre><span></span>gulp serve:dist --env prod
</pre></div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Deploy</h3>
<div class="outline-text-3" id="text-2-5">
<div class="highlight"><pre><span></span>gulp deploy:firebaserules --env prod
goapp deploy -application &lt;application ID&gt; -version &lt;version number&gt; dist/backend/.
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Temporary API</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Enable in dist</h3>
<div class="outline-text-3" id="text-3-1">
<p>
After building the app:
</p>
<div class="highlight"><pre><span></span>cp -r app/temporary_api/ dist/app/
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Live Stream</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>
<a href="http://localhost:3000/io2016/api/v1/livestream">http://localhost:3000/io2016/api/v1/livestream</a>
</li>
</ul>
</div>
</div>
    </div>
    
</article>
</div>
            </div>
        </div>
        <button class="btn btn-fab btn-raised btn-material-green btn-footer" data-toggle="modal" data-target="#footer-dialog">
            <i class="mdi-communication-message"></i>
        </button>
        <div id="footer-dialog" class="modal fade" tabindex="-1">
          <div class="modal-dialog">
            <div class="modal-content">
            <div class="modal-header">
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true">×</button>
                <h4 class="modal-title">ncouture
.github.io credits</h4>
 
              </div>
              <div class="modal-body">
                    Contents © 2016         <a href="mailto:nicolas.couture@gmail.com">Nicolas Couture</a>
                    
              </div>
              <div class="modal-footer">
                <button class="btn btn-primary" data-dismiss="modal">Ok</button>
              </div>
            </div>
          </div>
        </div>
        <div class="source-button">
    <a class="btn btn-fab btn-raised btn-material-indigo" target="_blank" href="index.org" title="Source">
        <i class="mdi-file-cloud-download"></i>
    </a>

        </div>
</div>

            <script src="../../assets/js/all-nocdn.js"></script><script>

            $(document).ready(function() {
                // This command is used to initialize some elements and make them work properly
                $.material.init();
            });

            $(window).on("resize", function() {
                $("html, body").height($(window).height());
                $(".main, .menu").height($(window).height() - $(".header-panel").outerHeight() - 76 ); // footer margin: $("footer.footer").outerHeight()
                $(".posts-material").height($(window).height());
            }).trigger("resize");
        </script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-84015735-1', 'auto');
  ga('send', 'pageview');

</script>
</body>
</html>
